erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/СХК_МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСклад</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/AccumulationRegisters/СХК_ТоварыНаСкладе/СХК_ТоварыНаСкладе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СХК_ТоварыНаСкладе</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СХК_СкладЯчейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erpdev.СХК_Расширение/src/Catalogs/СХК_СкладЯчейки/СХК_СкладЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СХК_СкладЯчейки</name>
  <attributes>
    <name>Ряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВМестимость</name>
    <type>
      <types>EnumRef.СХК_ВМестимость</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/Forms/ФормаИнформация/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.СканШК;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АктивироватьПоискПеремещения();
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПоискПеремещения() Экспорт
	
	ЭтаФорма.Элементы.СканШК.РедактированиеТекста = Истина;
	ОчиститьШКСервер(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьШКСервер()
	СканШК = "";
	ЭтаФорма.Элементы.ИнфоЯчейка.Заголовок = "";
	ЭтаФорма.Элементы.ИнфоСодержимое.Заголовок = "";
КонецПроцедуры


&НаСервере
Процедура СканШКИзменениеТекстаРедактированияНаСервере(ШК)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура,
	               |	СХК_ТоварыНаСкладеОстатки.Серия КАК Серия,
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	               |	СХК_СкладЯчейки.Наименование КАК Наименование
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СХК_СкладЯчейки КАК СХК_СкладЯчейки
	               |		ПО СХК_ТоварыНаСкладеОстатки.Ячейка = СХК_СкладЯчейки.Ссылка
	               |ГДЕ
	               |	СХК_СкладЯчейки.ШтрихКод = &ШтрихКод
	               |	И СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток > 1
	               |	И СХК_ТоварыНаСкладеОстатки.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ШтрихКод",ШК);   
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество()>=1 Тогда
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Ложь;
		
		ЭтаФорма.Элементы.ИнфоЯчейка.Заголовок = Рез[0].Наименование;
		
		Инфо = "";
		
		Для Каждого стр из Рез Цикл
			
			Инфо = Инфо + Строка(стр.Номенклатура) + Символы.ПС + 
			Строка(стр.Серия) + Символы.ПС +
			Строка(стр.ВНаличииОстаток) + Символы.ПС + "---------------";
			
		КонецЦикла;
		
		ЭтаФорма.Элементы.ИнфоСодержимое.Заголовок = Инфо;
		
	Иначе
		ЭтаФорма.Элементы.Ошибка.Видимость = Истина;
		ЭтаФорма.Элементы.ИнфоЯчейка.Заголовок = "";
		ЭтаФорма.Элементы.ИнфоСодержимое.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	СканШКИзменениеТекстаРедактированияНаСервере(Текст);
КонецПроцедуры


&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "ГруппаНоменклатура" Тогда
		АктивироватьПоискQR();	
	ИначеЕсли ТекущаяСтраница.Имя = "ГруппаИнфо" Тогда
		АктивироватьПоискПеремещения();	
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура АктивироватьПоискQR() Экспорт
	
	ЭтаФорма.Элементы.СканQR.РедактированиеТекста = Истина;
	ОчиститьQRСервер(); 
	Элементы.СканQR.ОбновитьТекстРедактирования();
	Элементы.СканQR.Видимость = Ложь;
	Элементы.СканQR.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканQR; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры 

&НаСервере
Процедура ОчиститьQRСервер()
	СканQR = "";
	ЭтаФорма.Элементы.ИнфоНоменклатура.Заголовок = "";
	ЭтаФорма.Элементы.ИнфоСодержимоеНоменклатура.Заголовок = "";
КонецПроцедуры

&НаКлиенте
Процедура СканQRИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если ПроверкаНаЧисло(Текст) = Истина Тогда
		ОткрытьФормуСообщения("Отсканируйте QR");
	Иначе
		Мас = Новый Массив;
		Если СтрНайти(Текст, ";") = 0 Тогда
			ОткрытьФормуСообщения("Отсканируйте QR");
		Иначе
			Мас = Разложить(Текст,";");
			Если Мас.Количество() = 2 Тогда
				СформироватьИнформацию(Мас);
			Иначе
			    ОткрытьФормуСообщения("Отсканируйте правильный QR");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Функция ПроверкаНаЧисло(НашаСтрокаДляРазбора) Экспорт
	Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Число") Тогда
		Возврат Истина
	Иначе
		Если ТипЗнч(НашаСтрокаДляРазбора) = Тип("Строка") Тогда
			Если НашаСтрокаДляРазбора = "" Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ПМ = Число(НашаСтрокаДляРазбора);
		Исключение
			Возврат Ложь;
		КонецПопытки;
		Возврат Истина;
	КонецЕсли;
КонецФункции 

Функция Разложить(Знач Стр, Разделитель = ";") Экспорт
	
	Список = Новый Массив();
	Длина = СтрДлина(Разделитель);
	
	Стр = СокрЛП(Стр);
	Поз = Найти(Стр, Разделитель);
	
	Пока 0 < Поз Цикл
		Список.Добавить(СокрП(Лев(Стр, Поз-1)));
		
		Стр = СокрЛ(Сред(Стр, Поз+Длина));
		Поз = Найти(Стр, Разделитель);
	КонецЦикла;
	
	Список.Добавить(Стр);
	
	Возврат Список;
	
КонецФункции



&НаКлиенте
Процедура ОткрытьФормуСообщения(Сообщение) 
	Отбор = Новый Структура;
	Отбор.Вставить("Ошибка",Строка(Сообщение));
		АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(Отбор,Новый УникальныйИдентификатор);
		_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыСообщения", ЭтаФорма);
		ОткрытьФорму("Обработка.СХК_МобильныйСклад.Форма.ФормаСообщений", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗакрытиеФормыСообщения(Значение, ДопПараметры) Экспорт 
						
КонецПроцедуры


&НаСервере
Процедура СформироватьИнформацию(Мас)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток КАК Остаток,
	               |	СХК_ТоварыНаСкладеОстатки.Ячейка КАК Ячейка,
	               |	СХК_ТоварыНаСкладеОстатки.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрНакопления.СХК_ТоварыНаСкладе.Остатки КАК СХК_ТоварыНаСкладеОстатки
	               |ГДЕ
	               |	СХК_ТоварыНаСкладеОстатки.Серия = &Серия
	               |	И СХК_ТоварыНаСкладеОстатки.ВНаличииОстаток >= &ВНаличииОстаток";
	
	Запрос.УстановитьПараметр("Серия",Мас[0]);   
	Запрос.УстановитьПараметр("ВНаличииОстаток",1);   
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Если Рез.Количество()>=1 Тогда
		
		ЭтаФорма.Элементы.Ошибка.Видимость = Ложь;
		ЭтаФорма.Элементы.ИнфоНоменклатура.Заголовок = Рез[0].Номенклатура;
		
		
		Инфо = "";
		
		Для Каждого стр из Рез Цикл
			
			Инфо = Инфо + Строка(стр.Ячейка) + Символы.ПС + 
			Строка(стр.Остаток) + Символы.ПС + "---------------"+ Символы.ПС;
			
		КонецЦикла;
		
		ЭтаФорма.Элементы.ИнфоСодержимоеНоменклатура.Заголовок = Инфо;
		
	Иначе
		ЭтаФорма.Элементы.Ошибка.Видимость = Истина;
		ЭтаФорма.Элементы.ИнфоЯчейка.Заголовок = "";
		ЭтаФорма.Элементы.ИнфоСодержимое.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры
